__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          (None, 32, None, 1)  0                                            
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 32, None, 64) 640         the_input[0][0]                  
__________________________________________________________________________________________________
pool1 (MaxPooling2D)            (None, 16, None, 64) 0           conv1[0][0]                      
__________________________________________________________________________________________________
conv2 (Conv2D)                  (None, 16, None, 128 73856       pool1[0][0]                      
__________________________________________________________________________________________________
pool2 (MaxPooling2D)            (None, 8, None, 128) 0           conv2[0][0]                      
__________________________________________________________________________________________________
conv3 (Conv2D)                  (None, 8, None, 256) 295168      pool2[0][0]                      
__________________________________________________________________________________________________
conv4 (Conv2D)                  (None, 8, None, 256) 590080      conv3[0][0]                      
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 8, None, 256) 0           conv4[0][0]                      
__________________________________________________________________________________________________
pool3 (MaxPooling2D)            (None, 4, None, 256) 0           zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
conv5 (Conv2D)                  (None, 4, None, 512) 1180160     pool3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 4, None, 512) 16          conv5[0][0]                      
__________________________________________________________________________________________________
conv6 (Conv2D)                  (None, 4, None, 512) 2359808     batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 4, None, 512) 16          conv6[0][0]                      
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 4, None, 512) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
pool4 (MaxPooling2D)            (None, 2, None, 512) 0           zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
conv7 (Conv2D)                  (None, 1, None, 512) 1049088     pool4[0][0]                      
__________________________________________________________________________________________________
permute (Permute)               (None, None, 1, 512) 0           conv7[0][0]                      
__________________________________________________________________________________________________
timedistrib (TimeDistributed)   (None, None, 512)    0           permute[0][0]                    
__________________________________________________________________________________________________
blstm1 (Bidirectional)          (None, None, 512)    1181184     timedistrib[0][0]                
__________________________________________________________________________________________________
blstm1_out (Dense)              (None, None, 256)    131328      blstm1[0][0]                     
__________________________________________________________________________________________________
blstm2 (Bidirectional)          (None, None, 512)    787968      blstm1_out[0][0]                 
__________________________________________________________________________________________________
blstm2_out (Dense)              (None, None, 1024)   525312      blstm2[0][0]                     
__________________________________________________________________________________________________
the_labels (InputLayer)         (None, None)         0                                            
__________________________________________________________________________________________________
input_length (InputLayer)       (None, 1)            0                                            
__________________________________________________________________________________________________
label_length (InputLayer)       (None, 1)            0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           blstm2_out[0][0]                 
                                                                 the_labels[0][0]                 
                                                                 input_length[0][0]               
                                                                 label_length[0][0]               
==================================================================================================
Total params: 8,174,624
Trainable params: 8,174,608
Non-trainable params: 16
__________________________________________________________________________________________________
None
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
the_input (InputLayer)       (None, 32, None, 1)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 32, None, 64)      640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 16, None, 64)      0         
_________________________________________________________________
conv2 (Conv2D)               (None, 16, None, 128)     73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 8, None, 128)      0         
_________________________________________________________________
conv3 (Conv2D)               (None, 8, None, 256)      295168    
_________________________________________________________________
conv4 (Conv2D)               (None, 8, None, 256)      590080    
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 8, None, 256)      0         
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 4, None, 256)      0         
_________________________________________________________________
conv5 (Conv2D)               (None, 4, None, 512)      1180160   
_________________________________________________________________
batch_normalization_1 (Batch (None, 4, None, 512)      16        
_________________________________________________________________
conv6 (Conv2D)               (None, 4, None, 512)      2359808   
_________________________________________________________________
batch_normalization_2 (Batch (None, 4, None, 512)      16        
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 4, None, 512)      0         
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 2, None, 512)      0         
_________________________________________________________________
conv7 (Conv2D)               (None, 1, None, 512)      1049088   
_________________________________________________________________
permute (Permute)            (None, None, 1, 512)      0         
_________________________________________________________________
timedistrib (TimeDistributed (None, None, 512)         0         
_________________________________________________________________
blstm1 (Bidirectional)       (None, None, 512)         1181184   
_________________________________________________________________
blstm1_out (Dense)           (None, None, 256)         131328    
_________________________________________________________________
blstm2 (Bidirectional)       (None, None, 512)         787968    
_________________________________________________________________
blstm2_out (Dense)           (None, None, 1024)        525312    
=================================================================
Total params: 8,174,624
Trainable params: 8,174,608
Non-trainable params: 16
_________________________________________________________________
None
